import winsound
import time

HZ = 600
DOT_TIME = 150
DASH_TIME = DOT_TIME*3
MORSE_LIBRARY = {
    " ": " ",
    "1": "01111", 
    "2": "00111", 
    "3": "00011", 
    "4": "00001",
    "5": "00000",
    "6": "10000",
    "7": "11000",
    "8": "11100",
    "9": "11110",
    "0": "11111",
    "a": "01",
    "b": "1000",
    "c": "1010",
    "d": "100",
    "e": "0",
    "f": "0010",
    "g": "110",
    "h": "0000",
    "i": "00",
    "j": "0111",
    "k": "101",
    "l": "0100",
    "m": "11",
    "n": "10",
    "o": "111",
    "p": "0110",
    "q": "1101",
    "r": "010",
    "s": "000",
    "t": "1",
    "u": "001",
    "v": "0001",
    "w": "011",
    "x": "1001",
    "y": "1011",
    "z": "1100",
    "а": "01",
    "б": "1000",
    "в": "011",
    "г": "110",
    "д": "100",
    "е": "0",
    "ё": "0",
    "ж": "0001",
    "з": "1100",
    "и": "00",
    "й": "0111",
    "к": "101",
    "л": "0100",
    "м": "11",
    "н": "10",
    "о": "111",
    "п": "0110",
    "р": "010",
    "с": "000",
    "т": "1",
    "у": "001",
    "ф": "0010",
    "х": "0000",
    "ц": "1010",
    "ч": "1110",
    "ш": "1111",
    "щ": "1101",
    "ъ": "011010",
    "ы": "1011",
    "ь": "1001",
    "э": "0001000",
    "ю": "0011",
    "я": "0101",
    ".": "000000",
    ",": "010101",
    "!": "110011",
    "?": "001100",
    ":": "111000",
    ";": "101010",
    "-": "100001",
    "–": "100001",
    "—": "100001",
    "=": "10001",
    "/": "10010",
    "(": "101101",
    ")": "101101",
    "'": "011110",
    '"': "01010",
    "_": "001101",
    "№": "001101",
    }

def is_text_valid(text):
    for symbol in text:
        if symbol not in MORSE_LIBRARY.keys():
            return False
    return True

def translate_to_morse(text):
    morse_text = ""
    for symbol in text:
        morse_text += MORSE_LIBRARY[symbol] + " "
    for symbol in morse_text:
        if symbol == "0":
            print("·", end="")
            winsound.Beep(HZ, DOT_TIME)
        elif symbol == "1":
            print("—", end="")
            winsound.Beep(HZ, DASH_TIME)
        else:
            print()
            time.sleep(DOT_TIME/2000)

while True:
    user_text = input("Введите текст:\n").lower().strip()
    if len(user_text) == 0:
        print("Вы ничего не ввели! Пожалуйста, введите что-нибудь.")
    elif not is_text_valid(user_text):
        print("Во введённом вами тексте есть символы, которые программа не может перевести в код Морзе! Пожалуйста, попробуйте ещё раз.")
    else:
        translate_to_morse(user_text)
        break